Repository: cregouby/luz
Catalog: po/R-*.po
Languages: fr

source: Wrong number of parameters in the prepared model.
fr: Nombre incorrect de paramètres dans le modèle après préparation.

source: Please report an issue in the GitHub repository.
fr: Merci d'ouvrir une issue dans le dépot Github.

source: Unhandled object with class {class(obj)}
fr: Les objets de classe {class(obj)} ne sont pas traités.

source: Only nn_modules, optimizers and dataloaders are supported.
fr: Seuls les `nn_modules`, les optimiseurs et les `dataloaders` sont pris en charge.

source: Unsupported object with class '
fr: Les objets de classe `

source: Can't convert object with class '%s' to a torch dataset.
fr: Impossible de convertir les objets de classe '%s' en jeu de donnée `torch::dataset`.

source: Expected monitored metric to be length 1, got {length(out)}
fr: La métrique sous surveillance doit être de longueur 1. Elle est en fait de {length(out)}.

source: Error while calling callback with class {.cls {class(callback)}} at {.field {name}}.
fr: Erreur pendant l'appel de `callback` de classe {.cls {class(callback)}} sur {.field {name}}.

source: Error when evaluating {.field update} for metric with abbrev {.val {metric$abbrev}} and class {.cls {class(metric)}}
fr: Erreur pendant l'évaluation de {.field update} pour la métrique abrégée {.val {metric$abbrev}} de classe {.cls {class(metric)}}.

source: The error happened at iter {.val {ctx$iter}} of epoch {.val {ctx$epoch}}.
fr: L'erreur a eu lieu à l'itération {.val {ctx$iter}} de l'époque {.val {ctx$epoch}}.

source: The model was {.emph {ifelse(ctx$training, '', 'not ')}}in training mode.
fr: Le modèle {.emph {ifelse(ctx$training, 'était ', 'n'était pas ')}} en mode apprentissage.

source: Error when evaluating {.field compute} for metric with abbrev {.val {metric$abbrev}} and class {.cls {class(metric)}}
fr: Erreur pendant l'évaluation de {.field compute} pour la métrique abrégée {.val {metric$abbrev}} de classe {.cls {class(metric)}}.

source: An optimizer name was not supplied and your model has multiple optimizers
fr: Le nom d'un optimiseur n'a pas été fourni et votre modèle comporte plusieurs optimiseurs

source: opt_name '{self$opt_name}' not found in ctx$optimizers.
fr: l'optimiseur nommé '{self$opt_name}' n'existe pas dans `ctx$optimizers`.

source: {.var max_norm} should be a numeric scalar value.
fr: {.var max_norm} doit être une valeur numérique.

source: Got {.cls {class(max_norm)}} with length {length(max_norm)}
fr: Ici, {.cls {class(max_norm)}} est de longueur {length(max_norm)}.

source: {.var norm_type} should be a numeric scalar value.
fr: {.var norm_type} doit être une valeur numérique.

source: Got {.cls {class(norm_type)}} with length {length(norm_type)}
fr: Ici, {.cls {class(norm_type)}} est de longueur {length(norm_type)}.

source: You are unsafe setting records and it's overriding current data.
fr: Il est très risqué d'affecter des valeurs aux `records`. De plus, cela écrase toutes les données existantes.

source: Not allowed to modify records manually. Use ctx$log() or ctx$log_metric()
fr: Il n'est pas permis de modifier les journaux directement. Ils sont modifiables via `ctx$log()` ou `ctx$log_metric()`.

source: Not allowed to modify the device manually. Modify the ctx$accelerator
fr: Il n'est pas permis de modifier le périphérique `device` directement. Il est modifiable via `ctx$accelerator`.

source: Context doesn't have an accelerator attached.
fr: Le contexte n'a pas d'accélérateur associé.

source: {.var ctx$opt} not set.
fr: {.var ctx$opt} n'est pas configuré.

source: {.var ctx$opt_name} not set.
fr: {.var ctx$opt_name} n'est pas configuré.

source: Expected `min_epochs` to be a scalar integer, got {str(min)}.
fr: `min_epochs` doit être un entier, mais c'est {str(min)}.

source: Expected `max_epochs` to be a scalar integer, got {str(max)}.
fr: `max_epochs` doit être un entier, mais c'est {str(max)}.

source: `min_epochs` is higher than `max_epochs` and that's not allowed.
fr: `min_epochs` est supérieur à `max_epochs` et ce n'est pas autorisé.

source: List of optimizers is not named.
fr: Les optimiseurs doivent être définis dans une liste nommée.

source: When returning a list of optimizers, the list must be named.
fr: Lorsqu'une liste d'optimiseurs est renvoyée, elle doit être nommée.

source: Expected a torch optimizer but got an object with class '{class(i)[1]}'.
fr: Un optimiseur torch est attendu, mais ici c'est un objet de classe '{class(i)[1]}'.

source: Loss must be a `nn_module`.
fr: La fonction de coût doit être un `nn_module`.

source: The `reduction` attribute must be supported by the `nn_module`.
fr: L'attribut `reduction` doit être supporté par le `nn_module`.

source: num_thresholds must be > 1
fr: `num_thresholds` doit être > 1.

source: not implemented
fr: non implémenté

source: Expected an object with class {.cls luz_metric_generator}.
fr: La classe de l'objet doit être {.cls luz_metric_generator}.

source: Got an object with class {.cls {class(x)}}.
fr: Mais ici l'objet a une classe {.cls {class(x)}}.

source: No loss function has been provided.
fr: La fonction de coût est manquante.

source: Use the `loss` argument or,
fr: Vous devez fournir l'argument `loss`, ou

source: Implement the `loss` method in the `nn_module` or,
fr: implémenter une méthode `loss` dans le `nn_module`, ou

source: Implement a custom `step` method that manually optimized the parameters.
fr: implémenter une méthode `step` spécifique qui inclue l'optimisation des paramètres.

source: No optimizer definition has been provided.
fr: La définition de l'optimiseur est manquante.

source: Use the optimizer argument or,
fr: Vous devez utiliser l'argument `optimizer`, ou

source: Implement the `set_optimizers` method in the `nn_module`.
fr: implémenter la méthode `set_optimizers` dans le `nn_module`.

source: backward should be a function with a single argument
fr: `backward` doit être une fonction à un seul argument.

source: valid_data must be a value between 0 and 1, got %f
fr: `valid_data` doit être entre 0 et 1. Ici, c'est %f

source: Can't create a validation set from the training dataloader.
fr: Impossible de créer un jeu de données de validation à partir du dataloader d'apprentissage.

source: Supply a torch dataset instead.
fr: Il faut fournir un jeu de donnée torch `dataset` à la place.

source: `dataloader_options` won't be used because `data` is already a dataloader.
fr: `dataloader_options` sera ignoré pour `data` puisqu'il s'agit déjà d'un dataloader.

source: `dataloader_options` will be ignored for `valid_data` since it's already a dataloader
fr: `dataloader_options` sera ignoré pour `valid_data` puisqu'il s'agit déjà d'un dataloader

source: `shuffle=TRUE` will be ignored for predictions.
fr: `shuffle=TRUE` sera ignoré pour les prédictions.

source: luz_save only works with 'luz_module_fitted_objects' and got {class(obj)[1]}
fr: `luz_save` ne prend en compte que les objets `luz_module_fitted_objects`. Ici, c'est un {class(obj)[1]}.

source: Failed resuming the model.
fr: Échec de reprise sur le modèle.

source: A callback with class {.cls {class(cb)} has been attached
fr: Un `callback` de classe {.cls {class(cb)} lui est attaché

source: to it, but doesn't implement the {.fn load_state_dict} method.
fr: mais il lui manque la méthode {.fn load_state_dict}.

source: No {.val forward} method found.
fr: La méthode {.val forward} est manquante.

source: Should have an out class.
fr: Doit inclure une classe `out`.

source: The
fr: Le

source: package must be installed in order to use `
fr: paquet doit être installé pour pouvoir utiliser `

source: Do you need to run `install.packages('
fr: Vous pouvez essayer `install.packages('

source: Objects must have the same length.
fr: Les objets doivent avoir la même taille.
